# YOLOv8 Medium-Lightweight configuration
# Parameters: ~6M (between 11M and 3M)

# Parameters
nc: 2  # number of classes
scales:
  n: [0.33, 0.25, 0.5]
  s: [0.33, 0.50, 0.75]  # 增加通道数
  m: [0.67, 0.75, 1.00]
  l: [1.00, 1.00, 1.00]
  x: [1.00, 1.25, 1.00]

# YOLOv8.0s backbone with medium channels
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [48, 3, 2]]  # 0-P1/2  (增加到48)
  - [-1, 1, Conv, [96, 3, 2]]  # 1-P2/4  (增加到96)
  - [-1, 3, C2f, [96, True]]
  - [-1, 1, Conv, [192, 3, 2]]  # 3-P3/8  (增加到192)
  - [-1, 6, C2f, [192, True]]
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16  (增加到384)
  - [-1, 6, C2f, [384, True]]
  - [-1, 1, Conv, [768, 3, 2]]  # 7-P5/32  (增加到768)
  - [-1, 3, C2f, [768, True]]
  - [-1, 1, SPPF, [768, 5]]  # 9

# YOLOv8.0s head with medium channels
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [384]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [192]]  # 15 (P3/8-small)

  - [-1, 1, Conv, [192, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [384]]  # 18 (P4/16-medium)

  - [-1, 1, Conv, [384, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [768]]  # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)
