# LW-YOLOv8 模块测试配置文件 - psc-head-only.yaml
# 模块组合: CSP-CTFN=False, PSC-Head=True

nc: 2  # 类别数量 (head=0, helmet=1)
scales: # 模型复合缩放常数
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024] 
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# 骨干网络配置
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]     # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 1-P2/4  
  - [-1, 3, C2f, [128, True]]     # 2 - 保持原始C2f
  - [-1, 1, Conv, [256, 3, 2]]    # 3-P3/8
  - [-1, 6, C2f, [256, True]]     # 4 - 使用原始C2f
  - [-1, 1, Conv, [512, 3, 2]]    # 5-P4/16
  - [-1, 6, C2f, [512, True]]     # 6 - 使用原始C2f
  - [-1, 1, Conv, [1024, 3, 2]]   # 7-P5/32
  - [-1, 3, C2f, [1024, True]]    # 8 - 使用原始C2f
  - [-1, 1, SPPF, [1024, 5]]      # 9 - 空间金字塔池化

# 检测头配置
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 6], 1, Concat, [1]]     # 11 - cat backbone P4
  - [-1, 3, C2f, [512]]           # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13  
  - [[-1, 4], 1, Concat, [1]]     # 14 - cat backbone P3
  - [-1, 3, C2f, [256]]           # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]    # 16
  - [[-1, 12], 1, Concat, [1]]    # 17 - cat head P4
  - [-1, 3, C2f, [512]]           # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]    # 19
  - [[-1, 9], 1, Concat, [1]]     # 20 - cat head P5  
  - [-1, 3, C2f, [1024]]          # 21 (P5/32-large)

  - [[15, 18, 21], 1, PSCDetect, [nc]]  # 22 - 使用PSC-Head参数共享检测头